export const uiMessages = {
  emailLoginError: "Неправильний формат email або номера телефону",
  passwordLoginError:
    "Пароль повинен містити як мінімум 1 цифру, 1 велику літеру і 1 малу літеру, також не повинен містити кирилицю та пробіли",
  phoneLoginError: "Неправильний формат email або номера телефону",
  symbolError: "має містити лише літери",
  numberError: "Некоректний номер телефону",
  successProfileEdit: "Ви успішно відредагували профіль",
  requiredField: "Це поле обов’язкове",
  verifyPhoneError: "Спочатку верифікуйте номер телефону",
  legalIdError: "Код ЄДРПОУ не може бути коротше 8 символів",
  privateIdError: "Код ІПН не може бути коротше 10 символів",
  invalidCityError: "Некоректно введена назва населеного пункту",
  invalidCodeError: "Введений код невірний",
  imageFormatError:
    "Формат зображення не підтримується. Допустимі формати: .jpg, .jpeg, .png.",
  imageSizeError:
    "Занадто великий розмір файлу. Розмір файлу не повинен перевищувати 5 мб.",
};
